>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. BFPROG.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 TAPE-TABLE.
    05 TAPE PIC S9(5) OCCURS 30000 TIMES VALUE 0.
01 PTR PIC 9(5) VALUE 1.
PROCEDURE DIVISION.
MAIN-PARA.
